---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArray.GetEnumerator
source: html/16766595-412e-66d1-d42d-9c154610c052.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.